Figure/Figure 5/simulations/dakota/casebase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           	GAMG;
        tolerance        	1e-6;
        relTol           	0.001;
        smoother         	GaussSeidel;
        nPreSweeps       	0;
        nPostSweeps      	2;
        cacheAgglomeration 	on;
        agglomerator     	faceAreaPair;
        nCellsInCoarsestLevel 	10;
        mergeLevels      	1;
	minIter 	 	2;
    }

    pFinal
    {
        solver          	PCG;
        preconditioner  	DIC;
        tolerance       	1e-06;
        relTol          	0;
	minIter			3;
    }

    U
    {
        type            	coupled;
        solver          	PBiCCCG;
        preconditioner  	DILU;
        tolerance               (1e-08 1e-08 1e-08);
        relTol                  (0 0 0);
    }

    UFinal
    {
	$U;
        tolerance               (1e-08 1e-08 1e-08);
        relTol                  (0 0 0);
    }

    omega
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
	minIter		3;
    }

    omegaFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
	minIter		3;
    }

    k
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
	minIter		3;
    }

    kFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
	minIter		3;
    }
}

PIMPLE
{
	//If enable you will need to add UFinal
	momentumPredictor yes;

	//If you set nOuterCorrectors to 1 is equivalent to piso    
        //nOuterCorrectors 1;
        nOuterCorrectors 2;

	nCorrectors 2;
	nNonOrthogonalCorrectors 1;
        pRefCell        0;
        pRefValue       0;
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        k               0.7;
        omega           0.7;
    }
}

// ************************************************************************* //
